---
kind: property
id: P:Autodesk.Revit.DB.StructuralAsset.Lightweight
source: html/e1b1bfb8-47f2-2ae6-9485-0031a48eff35.htm
---
# Autodesk.Revit.DB.StructuralAsset.Lightweight Property

Flag indicating whether the asset describes a material that is light-weight or not.

## Syntax (C#)
```csharp
public bool Lightweight { get; set; }
```